7767517
911 1099
Input                    img                      0 1 input
Split                    splitncnn_input0         1 4 input img_splitncnn_0 img_splitncnn_1 img_splitncnn_2 img_splitncnn_3
Convolution              Conv_0                   1 1 img_splitncnn_3 relu_0.tmp_0 0=64 1=3 3=2 4=-233 5=1 6=1728 9=1
Split                    splitncnn_0              1 2 relu_0.tmp_0 relu_0.tmp_0_splitncnn_0 relu_0.tmp_0_splitncnn_1
Convolution              Conv_1                   1 1 relu_0.tmp_0_splitncnn_1 relu_1.tmp_0 0=64 1=3 3=2 4=-233 5=1 6=36864 9=1
Split                    splitncnn_1              1 2 relu_1.tmp_0 relu_1.tmp_0_splitncnn_0 relu_1.tmp_0_splitncnn_1
Convolution              Conv_2                   1 1 relu_1.tmp_0_splitncnn_1 relu_2.tmp_0 0=64 1=1 4=-233 5=1 6=4096 9=1
Convolution              Conv_3                   1 1 relu_2.tmp_0 relu_3.tmp_0 0=64 1=3 4=-233 5=1 6=36864 9=1
Convolution              Conv_4                   1 1 relu_3.tmp_0 conv2d_332.tmp_0 0=256 1=1 4=-233 5=1 6=16384
Convolution              Conv_5                   1 1 relu_1.tmp_0_splitncnn_0 conv2d_333.tmp_0 0=256 1=1 4=-233 5=1 6=16384
BinaryOp                 Add_0                    2 1 conv2d_332.tmp_0 conv2d_333.tmp_0 elementwise_add_0
ReLU                     Relu_4                   1 1 elementwise_add_0 relu_4.tmp_0
Split                    splitncnn_2              1 2 relu_4.tmp_0 relu_4.tmp_0_splitncnn_0 relu_4.tmp_0_splitncnn_1
Convolution              Conv_6                   1 1 relu_4.tmp_0_splitncnn_1 relu_5.tmp_0 0=64 1=1 4=-233 5=1 6=16384 9=1
Convolution              Conv_7                   1 1 relu_5.tmp_0 relu_6.tmp_0 0=64 1=3 4=-233 5=1 6=36864 9=1
Convolution              Conv_8                   1 1 relu_6.tmp_0 conv2d_336.tmp_0 0=256 1=1 4=-233 5=1 6=16384
BinaryOp                 Add_1                    2 1 conv2d_336.tmp_0 relu_4.tmp_0_splitncnn_0 elementwise_add_1
ReLU                     Relu_7                   1 1 elementwise_add_1 relu_7.tmp_0
Split                    splitncnn_3              1 2 relu_7.tmp_0 relu_7.tmp_0_splitncnn_0 relu_7.tmp_0_splitncnn_1
Convolution              Conv_9                   1 1 relu_7.tmp_0_splitncnn_1 relu_8.tmp_0 0=64 1=1 4=-233 5=1 6=16384 9=1
Convolution              Conv_10                  1 1 relu_8.tmp_0 relu_9.tmp_0 0=64 1=3 4=-233 5=1 6=36864 9=1
Convolution              Conv_11                  1 1 relu_9.tmp_0 conv2d_339.tmp_0 0=256 1=1 4=-233 5=1 6=16384
BinaryOp                 Add_2                    2 1 conv2d_339.tmp_0 relu_7.tmp_0_splitncnn_0 elementwise_add_2
ReLU                     Relu_10                  1 1 elementwise_add_2 relu_10.tmp_0
Split                    splitncnn_4              1 2 relu_10.tmp_0 relu_10.tmp_0_splitncnn_0 relu_10.tmp_0_splitncnn_1
Convolution              Conv_12                  1 1 relu_10.tmp_0_splitncnn_1 relu_11.tmp_0 0=64 1=1 4=-233 5=1 6=16384 9=1
Convolution              Conv_13                  1 1 relu_11.tmp_0 relu_12.tmp_0 0=64 1=3 4=-233 5=1 6=36864 9=1
Convolution              Conv_14                  1 1 relu_12.tmp_0 conv2d_342.tmp_0 0=256 1=1 4=-233 5=1 6=16384
BinaryOp                 Add_3                    2 1 conv2d_342.tmp_0 relu_10.tmp_0_splitncnn_0 elementwise_add_3
ReLU                     Relu_13                  1 1 elementwise_add_3 relu_13.tmp_0
Split                    splitncnn_5              1 2 relu_13.tmp_0 relu_13.tmp_0_splitncnn_0 relu_13.tmp_0_splitncnn_1
Convolution              Conv_15                  1 1 relu_13.tmp_0_splitncnn_1 relu_14.tmp_0 0=18 1=3 4=-233 5=1 6=41472 9=1
Split                    splitncnn_6              1 2 relu_14.tmp_0 relu_14.tmp_0_splitncnn_0 relu_14.tmp_0_splitncnn_1
Convolution              Conv_16                  1 1 relu_13.tmp_0_splitncnn_0 relu_15.tmp_0 0=36 1=3 3=2 4=-233 5=1 6=82944 9=1
Split                    splitncnn_7              1 2 relu_15.tmp_0 relu_15.tmp_0_splitncnn_0 relu_15.tmp_0_splitncnn_1
Convolution              Conv_17                  1 1 relu_14.tmp_0_splitncnn_1 relu_16.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_18                  1 1 relu_16.tmp_0 conv2d_346.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_4                    2 1 conv2d_346.tmp_0 relu_14.tmp_0_splitncnn_0 elementwise_add_4
ReLU                     Relu_17                  1 1 elementwise_add_4 relu_17.tmp_0
Split                    splitncnn_8              1 2 relu_17.tmp_0 relu_17.tmp_0_splitncnn_0 relu_17.tmp_0_splitncnn_1
Convolution              Conv_19                  1 1 relu_17.tmp_0_splitncnn_1 relu_18.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_20                  1 1 relu_18.tmp_0 conv2d_348.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_5                    2 1 conv2d_348.tmp_0 relu_17.tmp_0_splitncnn_0 elementwise_add_5
ReLU                     Relu_19                  1 1 elementwise_add_5 relu_19.tmp_0
Split                    splitncnn_9              1 2 relu_19.tmp_0 relu_19.tmp_0_splitncnn_0 relu_19.tmp_0_splitncnn_1
Convolution              Conv_21                  1 1 relu_19.tmp_0_splitncnn_1 relu_20.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_22                  1 1 relu_20.tmp_0 conv2d_350.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_6                    2 1 conv2d_350.tmp_0 relu_19.tmp_0_splitncnn_0 elementwise_add_6
ReLU                     Relu_21                  1 1 elementwise_add_6 relu_21.tmp_0
Split                    splitncnn_10             1 2 relu_21.tmp_0 relu_21.tmp_0_splitncnn_0 relu_21.tmp_0_splitncnn_1
Convolution              Conv_23                  1 1 relu_21.tmp_0_splitncnn_1 relu_22.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_24                  1 1 relu_22.tmp_0 conv2d_352.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_7                    2 1 conv2d_352.tmp_0 relu_21.tmp_0_splitncnn_0 elementwise_add_7
ReLU                     Relu_23                  1 1 elementwise_add_7 relu_23.tmp_0
Split                    splitncnn_11             1 2 relu_23.tmp_0 relu_23.tmp_0_splitncnn_0 relu_23.tmp_0_splitncnn_1
Convolution              Conv_25                  1 1 relu_15.tmp_0_splitncnn_1 relu_24.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_26                  1 1 relu_24.tmp_0 conv2d_354.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_8                    2 1 conv2d_354.tmp_0 relu_15.tmp_0_splitncnn_0 elementwise_add_8
ReLU                     Relu_25                  1 1 elementwise_add_8 relu_25.tmp_0
Split                    splitncnn_12             1 2 relu_25.tmp_0 relu_25.tmp_0_splitncnn_0 relu_25.tmp_0_splitncnn_1
Convolution              Conv_27                  1 1 relu_25.tmp_0_splitncnn_1 relu_26.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_28                  1 1 relu_26.tmp_0 conv2d_356.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_9                    2 1 conv2d_356.tmp_0 relu_25.tmp_0_splitncnn_0 elementwise_add_9
ReLU                     Relu_27                  1 1 elementwise_add_9 relu_27.tmp_0
Split                    splitncnn_13             1 2 relu_27.tmp_0 relu_27.tmp_0_splitncnn_0 relu_27.tmp_0_splitncnn_1
Convolution              Conv_29                  1 1 relu_27.tmp_0_splitncnn_1 relu_28.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_30                  1 1 relu_28.tmp_0 conv2d_358.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_10                   2 1 conv2d_358.tmp_0 relu_27.tmp_0_splitncnn_0 elementwise_add_10
ReLU                     Relu_29                  1 1 elementwise_add_10 relu_29.tmp_0
Split                    splitncnn_14             1 2 relu_29.tmp_0 relu_29.tmp_0_splitncnn_0 relu_29.tmp_0_splitncnn_1
Convolution              Conv_31                  1 1 relu_29.tmp_0_splitncnn_1 relu_30.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_32                  1 1 relu_30.tmp_0 conv2d_360.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_11                   2 1 conv2d_360.tmp_0 relu_29.tmp_0_splitncnn_0 elementwise_add_11
ReLU                     Relu_31                  1 1 elementwise_add_11 relu_31.tmp_0
Split                    splitncnn_15             1 2 relu_31.tmp_0 relu_31.tmp_0_splitncnn_0 relu_31.tmp_0_splitncnn_1
Convolution              Conv_33                  1 1 relu_31.tmp_0_splitncnn_1 conv2d_361.tmp_0 0=18 1=1 4=-233 5=1 6=648
Interp                   Resize_0                 1 1 conv2d_361.tmp_0 bilinear_interp_v2_0.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_12                   2 1 relu_23.tmp_0_splitncnn_1 bilinear_interp_v2_0.tmp_0 tmp_0
ReLU                     Relu_32                  1 1 tmp_0 relu_32.tmp_0
Split                    splitncnn_16             1 2 relu_32.tmp_0 relu_32.tmp_0_splitncnn_0 relu_32.tmp_0_splitncnn_1
Convolution              Conv_34                  1 1 relu_23.tmp_0_splitncnn_0 conv2d_362.tmp_0 0=36 1=3 3=2 4=-233 5=1 6=5832
BinaryOp                 Add_13                   2 1 relu_31.tmp_0_splitncnn_0 conv2d_362.tmp_0 tmp_1
ReLU                     Relu_33                  1 1 tmp_1 relu_33.tmp_0
Split                    splitncnn_17             1 3 relu_33.tmp_0 relu_33.tmp_0_splitncnn_0 relu_33.tmp_0_splitncnn_1 relu_33.tmp_0_splitncnn_2
Convolution              Conv_35                  1 1 relu_33.tmp_0_splitncnn_2 relu_34.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=23328 9=1
Split                    splitncnn_18             1 2 relu_34.tmp_0 relu_34.tmp_0_splitncnn_0 relu_34.tmp_0_splitncnn_1
Convolution              Conv_36                  1 1 relu_32.tmp_0_splitncnn_1 relu_35.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_37                  1 1 relu_35.tmp_0 conv2d_365.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_14                   2 1 conv2d_365.tmp_0 relu_32.tmp_0_splitncnn_0 elementwise_add_12
ReLU                     Relu_36                  1 1 elementwise_add_12 relu_36.tmp_0
Split                    splitncnn_19             1 2 relu_36.tmp_0 relu_36.tmp_0_splitncnn_0 relu_36.tmp_0_splitncnn_1
Convolution              Conv_38                  1 1 relu_36.tmp_0_splitncnn_1 relu_37.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_39                  1 1 relu_37.tmp_0 conv2d_367.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_15                   2 1 conv2d_367.tmp_0 relu_36.tmp_0_splitncnn_0 elementwise_add_13
ReLU                     Relu_38                  1 1 elementwise_add_13 relu_38.tmp_0
Split                    splitncnn_20             1 2 relu_38.tmp_0 relu_38.tmp_0_splitncnn_0 relu_38.tmp_0_splitncnn_1
Convolution              Conv_40                  1 1 relu_38.tmp_0_splitncnn_1 relu_39.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_41                  1 1 relu_39.tmp_0 conv2d_369.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_16                   2 1 conv2d_369.tmp_0 relu_38.tmp_0_splitncnn_0 elementwise_add_14
ReLU                     Relu_40                  1 1 elementwise_add_14 relu_40.tmp_0
Split                    splitncnn_21             1 2 relu_40.tmp_0 relu_40.tmp_0_splitncnn_0 relu_40.tmp_0_splitncnn_1
Convolution              Conv_42                  1 1 relu_40.tmp_0_splitncnn_1 relu_41.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_43                  1 1 relu_41.tmp_0 conv2d_371.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_17                   2 1 conv2d_371.tmp_0 relu_40.tmp_0_splitncnn_0 elementwise_add_15
ReLU                     Relu_42                  1 1 elementwise_add_15 relu_42.tmp_0
Split                    splitncnn_22             1 3 relu_42.tmp_0 relu_42.tmp_0_splitncnn_0 relu_42.tmp_0_splitncnn_1 relu_42.tmp_0_splitncnn_2
Convolution              Conv_44                  1 1 relu_33.tmp_0_splitncnn_1 relu_43.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_45                  1 1 relu_43.tmp_0 conv2d_373.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_18                   2 1 conv2d_373.tmp_0 relu_33.tmp_0_splitncnn_0 elementwise_add_16
ReLU                     Relu_44                  1 1 elementwise_add_16 relu_44.tmp_0
Split                    splitncnn_23             1 2 relu_44.tmp_0 relu_44.tmp_0_splitncnn_0 relu_44.tmp_0_splitncnn_1
Convolution              Conv_46                  1 1 relu_44.tmp_0_splitncnn_1 relu_45.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_47                  1 1 relu_45.tmp_0 conv2d_375.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_19                   2 1 conv2d_375.tmp_0 relu_44.tmp_0_splitncnn_0 elementwise_add_17
ReLU                     Relu_46                  1 1 elementwise_add_17 relu_46.tmp_0
Split                    splitncnn_24             1 2 relu_46.tmp_0 relu_46.tmp_0_splitncnn_0 relu_46.tmp_0_splitncnn_1
Convolution              Conv_48                  1 1 relu_46.tmp_0_splitncnn_1 relu_47.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_49                  1 1 relu_47.tmp_0 conv2d_377.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_20                   2 1 conv2d_377.tmp_0 relu_46.tmp_0_splitncnn_0 elementwise_add_18
ReLU                     Relu_48                  1 1 elementwise_add_18 relu_48.tmp_0
Split                    splitncnn_25             1 2 relu_48.tmp_0 relu_48.tmp_0_splitncnn_0 relu_48.tmp_0_splitncnn_1
Convolution              Conv_50                  1 1 relu_48.tmp_0_splitncnn_1 relu_49.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_51                  1 1 relu_49.tmp_0 conv2d_379.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_21                   2 1 conv2d_379.tmp_0 relu_48.tmp_0_splitncnn_0 elementwise_add_19
ReLU                     Relu_50                  1 1 elementwise_add_19 relu_50.tmp_0
Split                    splitncnn_26             1 3 relu_50.tmp_0 relu_50.tmp_0_splitncnn_0 relu_50.tmp_0_splitncnn_1 relu_50.tmp_0_splitncnn_2
Convolution              Conv_52                  1 1 relu_34.tmp_0_splitncnn_1 relu_51.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_53                  1 1 relu_51.tmp_0 conv2d_381.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_22                   2 1 conv2d_381.tmp_0 relu_34.tmp_0_splitncnn_0 elementwise_add_20
ReLU                     Relu_52                  1 1 elementwise_add_20 relu_52.tmp_0
Split                    splitncnn_27             1 2 relu_52.tmp_0 relu_52.tmp_0_splitncnn_0 relu_52.tmp_0_splitncnn_1
Convolution              Conv_54                  1 1 relu_52.tmp_0_splitncnn_1 relu_53.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_55                  1 1 relu_53.tmp_0 conv2d_383.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_23                   2 1 conv2d_383.tmp_0 relu_52.tmp_0_splitncnn_0 elementwise_add_21
ReLU                     Relu_54                  1 1 elementwise_add_21 relu_54.tmp_0
Split                    splitncnn_28             1 2 relu_54.tmp_0 relu_54.tmp_0_splitncnn_0 relu_54.tmp_0_splitncnn_1
Convolution              Conv_56                  1 1 relu_54.tmp_0_splitncnn_1 relu_55.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_57                  1 1 relu_55.tmp_0 conv2d_385.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_24                   2 1 conv2d_385.tmp_0 relu_54.tmp_0_splitncnn_0 elementwise_add_22
ReLU                     Relu_56                  1 1 elementwise_add_22 relu_56.tmp_0
Split                    splitncnn_29             1 2 relu_56.tmp_0 relu_56.tmp_0_splitncnn_0 relu_56.tmp_0_splitncnn_1
Convolution              Conv_58                  1 1 relu_56.tmp_0_splitncnn_1 relu_57.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_59                  1 1 relu_57.tmp_0 conv2d_387.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_25                   2 1 conv2d_387.tmp_0 relu_56.tmp_0_splitncnn_0 elementwise_add_23
ReLU                     Relu_58                  1 1 elementwise_add_23 relu_58.tmp_0
Split                    splitncnn_30             1 3 relu_58.tmp_0 relu_58.tmp_0_splitncnn_0 relu_58.tmp_0_splitncnn_1 relu_58.tmp_0_splitncnn_2
Convolution              Conv_60                  1 1 relu_50.tmp_0_splitncnn_2 conv2d_388.tmp_0 0=18 1=1 4=-233 5=1 6=648
Interp                   Resize_1                 1 1 conv2d_388.tmp_0 bilinear_interp_v2_1.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_26                   2 1 relu_42.tmp_0_splitncnn_2 bilinear_interp_v2_1.tmp_0 tmp_2
Convolution              Conv_61                  1 1 relu_58.tmp_0_splitncnn_2 conv2d_389.tmp_0 0=18 1=1 4=-233 5=1 6=1296
Interp                   Resize_2                 1 1 conv2d_389.tmp_0 bilinear_interp_v2_2.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_27                   2 1 tmp_2 bilinear_interp_v2_2.tmp_0 tmp_3
ReLU                     Relu_59                  1 1 tmp_3 relu_59.tmp_0
Split                    splitncnn_31             1 2 relu_59.tmp_0 relu_59.tmp_0_splitncnn_0 relu_59.tmp_0_splitncnn_1
Convolution              Conv_62                  1 1 relu_42.tmp_0_splitncnn_1 conv2d_390.tmp_0 0=36 1=3 3=2 4=-233 5=1 6=5832
BinaryOp                 Add_28                   2 1 relu_50.tmp_0_splitncnn_1 conv2d_390.tmp_0 tmp_4
Convolution              Conv_63                  1 1 relu_58.tmp_0_splitncnn_1 conv2d_391.tmp_0 0=36 1=1 4=-233 5=1 6=2592
Interp                   Resize_3                 1 1 conv2d_391.tmp_0 bilinear_interp_v2_3.tmp_0 0=2 3=64 4=64
BinaryOp                 Add_29                   2 1 tmp_4 bilinear_interp_v2_3.tmp_0 tmp_5
ReLU                     Relu_60                  1 1 tmp_5 relu_60.tmp_0
Split                    splitncnn_32             1 2 relu_60.tmp_0 relu_60.tmp_0_splitncnn_0 relu_60.tmp_0_splitncnn_1
Convolution              Conv_64                  1 1 relu_42.tmp_0_splitncnn_0 relu_61.tmp_0 0=18 1=3 3=2 4=-233 5=1 6=2916 9=1
Convolution              Conv_65                  1 1 relu_61.tmp_0 conv2d_393.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=11664
BinaryOp                 Add_30                   2 1 relu_58.tmp_0_splitncnn_0 conv2d_393.tmp_0 tmp_6
Convolution              Conv_66                  1 1 relu_50.tmp_0_splitncnn_0 conv2d_394.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=23328
BinaryOp                 Add_31                   2 1 tmp_6 conv2d_394.tmp_0 tmp_7
ReLU                     Relu_62                  1 1 tmp_7 relu_62.tmp_0
Split                    splitncnn_33             1 2 relu_62.tmp_0 relu_62.tmp_0_splitncnn_0 relu_62.tmp_0_splitncnn_1
Convolution              Conv_67                  1 1 relu_59.tmp_0_splitncnn_1 relu_63.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_68                  1 1 relu_63.tmp_0 conv2d_396.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_32                   2 1 conv2d_396.tmp_0 relu_59.tmp_0_splitncnn_0 elementwise_add_24
ReLU                     Relu_64                  1 1 elementwise_add_24 relu_64.tmp_0
Split                    splitncnn_34             1 2 relu_64.tmp_0 relu_64.tmp_0_splitncnn_0 relu_64.tmp_0_splitncnn_1
Convolution              Conv_69                  1 1 relu_64.tmp_0_splitncnn_1 relu_65.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_70                  1 1 relu_65.tmp_0 conv2d_398.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_33                   2 1 conv2d_398.tmp_0 relu_64.tmp_0_splitncnn_0 elementwise_add_25
ReLU                     Relu_66                  1 1 elementwise_add_25 relu_66.tmp_0
Split                    splitncnn_35             1 2 relu_66.tmp_0 relu_66.tmp_0_splitncnn_0 relu_66.tmp_0_splitncnn_1
Convolution              Conv_71                  1 1 relu_66.tmp_0_splitncnn_1 relu_67.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_72                  1 1 relu_67.tmp_0 conv2d_400.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_34                   2 1 conv2d_400.tmp_0 relu_66.tmp_0_splitncnn_0 elementwise_add_26
ReLU                     Relu_68                  1 1 elementwise_add_26 relu_68.tmp_0
Split                    splitncnn_36             1 2 relu_68.tmp_0 relu_68.tmp_0_splitncnn_0 relu_68.tmp_0_splitncnn_1
Convolution              Conv_73                  1 1 relu_68.tmp_0_splitncnn_1 relu_69.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_74                  1 1 relu_69.tmp_0 conv2d_402.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_35                   2 1 conv2d_402.tmp_0 relu_68.tmp_0_splitncnn_0 elementwise_add_27
ReLU                     Relu_70                  1 1 elementwise_add_27 relu_70.tmp_0
Split                    splitncnn_37             1 3 relu_70.tmp_0 relu_70.tmp_0_splitncnn_0 relu_70.tmp_0_splitncnn_1 relu_70.tmp_0_splitncnn_2
Convolution              Conv_75                  1 1 relu_60.tmp_0_splitncnn_1 relu_71.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_76                  1 1 relu_71.tmp_0 conv2d_404.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_36                   2 1 conv2d_404.tmp_0 relu_60.tmp_0_splitncnn_0 elementwise_add_28
ReLU                     Relu_72                  1 1 elementwise_add_28 relu_72.tmp_0
Split                    splitncnn_38             1 2 relu_72.tmp_0 relu_72.tmp_0_splitncnn_0 relu_72.tmp_0_splitncnn_1
Convolution              Conv_77                  1 1 relu_72.tmp_0_splitncnn_1 relu_73.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_78                  1 1 relu_73.tmp_0 conv2d_406.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_37                   2 1 conv2d_406.tmp_0 relu_72.tmp_0_splitncnn_0 elementwise_add_29
ReLU                     Relu_74                  1 1 elementwise_add_29 relu_74.tmp_0
Split                    splitncnn_39             1 2 relu_74.tmp_0 relu_74.tmp_0_splitncnn_0 relu_74.tmp_0_splitncnn_1
Convolution              Conv_79                  1 1 relu_74.tmp_0_splitncnn_1 relu_75.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_80                  1 1 relu_75.tmp_0 conv2d_408.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_38                   2 1 conv2d_408.tmp_0 relu_74.tmp_0_splitncnn_0 elementwise_add_30
ReLU                     Relu_76                  1 1 elementwise_add_30 relu_76.tmp_0
Split                    splitncnn_40             1 2 relu_76.tmp_0 relu_76.tmp_0_splitncnn_0 relu_76.tmp_0_splitncnn_1
Convolution              Conv_81                  1 1 relu_76.tmp_0_splitncnn_1 relu_77.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_82                  1 1 relu_77.tmp_0 conv2d_410.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_39                   2 1 conv2d_410.tmp_0 relu_76.tmp_0_splitncnn_0 elementwise_add_31
ReLU                     Relu_78                  1 1 elementwise_add_31 relu_78.tmp_0
Split                    splitncnn_41             1 3 relu_78.tmp_0 relu_78.tmp_0_splitncnn_0 relu_78.tmp_0_splitncnn_1 relu_78.tmp_0_splitncnn_2
Convolution              Conv_83                  1 1 relu_62.tmp_0_splitncnn_1 relu_79.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_84                  1 1 relu_79.tmp_0 conv2d_412.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_40                   2 1 conv2d_412.tmp_0 relu_62.tmp_0_splitncnn_0 elementwise_add_32
ReLU                     Relu_80                  1 1 elementwise_add_32 relu_80.tmp_0
Split                    splitncnn_42             1 2 relu_80.tmp_0 relu_80.tmp_0_splitncnn_0 relu_80.tmp_0_splitncnn_1
Convolution              Conv_85                  1 1 relu_80.tmp_0_splitncnn_1 relu_81.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_86                  1 1 relu_81.tmp_0 conv2d_414.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_41                   2 1 conv2d_414.tmp_0 relu_80.tmp_0_splitncnn_0 elementwise_add_33
ReLU                     Relu_82                  1 1 elementwise_add_33 relu_82.tmp_0
Split                    splitncnn_43             1 2 relu_82.tmp_0 relu_82.tmp_0_splitncnn_0 relu_82.tmp_0_splitncnn_1
Convolution              Conv_87                  1 1 relu_82.tmp_0_splitncnn_1 relu_83.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_88                  1 1 relu_83.tmp_0 conv2d_416.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_42                   2 1 conv2d_416.tmp_0 relu_82.tmp_0_splitncnn_0 elementwise_add_34
ReLU                     Relu_84                  1 1 elementwise_add_34 relu_84.tmp_0
Split                    splitncnn_44             1 2 relu_84.tmp_0 relu_84.tmp_0_splitncnn_0 relu_84.tmp_0_splitncnn_1
Convolution              Conv_89                  1 1 relu_84.tmp_0_splitncnn_1 relu_85.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_90                  1 1 relu_85.tmp_0 conv2d_418.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_43                   2 1 conv2d_418.tmp_0 relu_84.tmp_0_splitncnn_0 elementwise_add_35
ReLU                     Relu_86                  1 1 elementwise_add_35 relu_86.tmp_0
Split                    splitncnn_45             1 3 relu_86.tmp_0 relu_86.tmp_0_splitncnn_0 relu_86.tmp_0_splitncnn_1 relu_86.tmp_0_splitncnn_2
Convolution              Conv_91                  1 1 relu_78.tmp_0_splitncnn_2 conv2d_419.tmp_0 0=18 1=1 4=-233 5=1 6=648
Interp                   Resize_4                 1 1 conv2d_419.tmp_0 bilinear_interp_v2_4.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_44                   2 1 relu_70.tmp_0_splitncnn_2 bilinear_interp_v2_4.tmp_0 tmp_8
Convolution              Conv_92                  1 1 relu_86.tmp_0_splitncnn_2 conv2d_420.tmp_0 0=18 1=1 4=-233 5=1 6=1296
Interp                   Resize_5                 1 1 conv2d_420.tmp_0 bilinear_interp_v2_5.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_45                   2 1 tmp_8 bilinear_interp_v2_5.tmp_0 tmp_9
ReLU                     Relu_87                  1 1 tmp_9 relu_87.tmp_0
Split                    splitncnn_46             1 2 relu_87.tmp_0 relu_87.tmp_0_splitncnn_0 relu_87.tmp_0_splitncnn_1
Convolution              Conv_93                  1 1 relu_70.tmp_0_splitncnn_1 conv2d_421.tmp_0 0=36 1=3 3=2 4=-233 5=1 6=5832
BinaryOp                 Add_46                   2 1 relu_78.tmp_0_splitncnn_1 conv2d_421.tmp_0 tmp_10
Convolution              Conv_94                  1 1 relu_86.tmp_0_splitncnn_1 conv2d_422.tmp_0 0=36 1=1 4=-233 5=1 6=2592
Interp                   Resize_6                 1 1 conv2d_422.tmp_0 bilinear_interp_v2_6.tmp_0 0=2 3=64 4=64
BinaryOp                 Add_47                   2 1 tmp_10 bilinear_interp_v2_6.tmp_0 tmp_11
ReLU                     Relu_88                  1 1 tmp_11 relu_88.tmp_0
Split                    splitncnn_47             1 2 relu_88.tmp_0 relu_88.tmp_0_splitncnn_0 relu_88.tmp_0_splitncnn_1
Convolution              Conv_95                  1 1 relu_70.tmp_0_splitncnn_0 relu_89.tmp_0 0=18 1=3 3=2 4=-233 5=1 6=2916 9=1
Convolution              Conv_96                  1 1 relu_89.tmp_0 conv2d_424.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=11664
BinaryOp                 Add_48                   2 1 relu_86.tmp_0_splitncnn_0 conv2d_424.tmp_0 tmp_12
Convolution              Conv_97                  1 1 relu_78.tmp_0_splitncnn_0 conv2d_425.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=23328
BinaryOp                 Add_49                   2 1 tmp_12 conv2d_425.tmp_0 tmp_13
ReLU                     Relu_90                  1 1 tmp_13 relu_90.tmp_0
Split                    splitncnn_48             1 2 relu_90.tmp_0 relu_90.tmp_0_splitncnn_0 relu_90.tmp_0_splitncnn_1
Convolution              Conv_98                  1 1 relu_87.tmp_0_splitncnn_1 relu_91.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_99                  1 1 relu_91.tmp_0 conv2d_427.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_50                   2 1 conv2d_427.tmp_0 relu_87.tmp_0_splitncnn_0 elementwise_add_36
ReLU                     Relu_92                  1 1 elementwise_add_36 relu_92.tmp_0
Split                    splitncnn_49             1 2 relu_92.tmp_0 relu_92.tmp_0_splitncnn_0 relu_92.tmp_0_splitncnn_1
Convolution              Conv_100                 1 1 relu_92.tmp_0_splitncnn_1 relu_93.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_101                 1 1 relu_93.tmp_0 conv2d_429.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_51                   2 1 conv2d_429.tmp_0 relu_92.tmp_0_splitncnn_0 elementwise_add_37
ReLU                     Relu_94                  1 1 elementwise_add_37 relu_94.tmp_0
Split                    splitncnn_50             1 2 relu_94.tmp_0 relu_94.tmp_0_splitncnn_0 relu_94.tmp_0_splitncnn_1
Convolution              Conv_102                 1 1 relu_94.tmp_0_splitncnn_1 relu_95.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_103                 1 1 relu_95.tmp_0 conv2d_431.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_52                   2 1 conv2d_431.tmp_0 relu_94.tmp_0_splitncnn_0 elementwise_add_38
ReLU                     Relu_96                  1 1 elementwise_add_38 relu_96.tmp_0
Split                    splitncnn_51             1 2 relu_96.tmp_0 relu_96.tmp_0_splitncnn_0 relu_96.tmp_0_splitncnn_1
Convolution              Conv_104                 1 1 relu_96.tmp_0_splitncnn_1 relu_97.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_105                 1 1 relu_97.tmp_0 conv2d_433.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_53                   2 1 conv2d_433.tmp_0 relu_96.tmp_0_splitncnn_0 elementwise_add_39
ReLU                     Relu_98                  1 1 elementwise_add_39 relu_98.tmp_0
Split                    splitncnn_52             1 3 relu_98.tmp_0 relu_98.tmp_0_splitncnn_0 relu_98.tmp_0_splitncnn_1 relu_98.tmp_0_splitncnn_2
Convolution              Conv_106                 1 1 relu_88.tmp_0_splitncnn_1 relu_99.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_107                 1 1 relu_99.tmp_0 conv2d_435.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_54                   2 1 conv2d_435.tmp_0 relu_88.tmp_0_splitncnn_0 elementwise_add_40
ReLU                     Relu_100                 1 1 elementwise_add_40 relu_100.tmp_0
Split                    splitncnn_53             1 2 relu_100.tmp_0 relu_100.tmp_0_splitncnn_0 relu_100.tmp_0_splitncnn_1
Convolution              Conv_108                 1 1 relu_100.tmp_0_splitncnn_1 relu_101.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_109                 1 1 relu_101.tmp_0 conv2d_437.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_55                   2 1 conv2d_437.tmp_0 relu_100.tmp_0_splitncnn_0 elementwise_add_41
ReLU                     Relu_102                 1 1 elementwise_add_41 relu_102.tmp_0
Split                    splitncnn_54             1 2 relu_102.tmp_0 relu_102.tmp_0_splitncnn_0 relu_102.tmp_0_splitncnn_1
Convolution              Conv_110                 1 1 relu_102.tmp_0_splitncnn_1 relu_103.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_111                 1 1 relu_103.tmp_0 conv2d_439.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_56                   2 1 conv2d_439.tmp_0 relu_102.tmp_0_splitncnn_0 elementwise_add_42
ReLU                     Relu_104                 1 1 elementwise_add_42 relu_104.tmp_0
Split                    splitncnn_55             1 2 relu_104.tmp_0 relu_104.tmp_0_splitncnn_0 relu_104.tmp_0_splitncnn_1
Convolution              Conv_112                 1 1 relu_104.tmp_0_splitncnn_1 relu_105.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_113                 1 1 relu_105.tmp_0 conv2d_441.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_57                   2 1 conv2d_441.tmp_0 relu_104.tmp_0_splitncnn_0 elementwise_add_43
ReLU                     Relu_106                 1 1 elementwise_add_43 relu_106.tmp_0
Split                    splitncnn_56             1 3 relu_106.tmp_0 relu_106.tmp_0_splitncnn_0 relu_106.tmp_0_splitncnn_1 relu_106.tmp_0_splitncnn_2
Convolution              Conv_114                 1 1 relu_90.tmp_0_splitncnn_1 relu_107.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_115                 1 1 relu_107.tmp_0 conv2d_443.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_58                   2 1 conv2d_443.tmp_0 relu_90.tmp_0_splitncnn_0 elementwise_add_44
ReLU                     Relu_108                 1 1 elementwise_add_44 relu_108.tmp_0
Split                    splitncnn_57             1 2 relu_108.tmp_0 relu_108.tmp_0_splitncnn_0 relu_108.tmp_0_splitncnn_1
Convolution              Conv_116                 1 1 relu_108.tmp_0_splitncnn_1 relu_109.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_117                 1 1 relu_109.tmp_0 conv2d_445.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_59                   2 1 conv2d_445.tmp_0 relu_108.tmp_0_splitncnn_0 elementwise_add_45
ReLU                     Relu_110                 1 1 elementwise_add_45 relu_110.tmp_0
Split                    splitncnn_58             1 2 relu_110.tmp_0 relu_110.tmp_0_splitncnn_0 relu_110.tmp_0_splitncnn_1
Convolution              Conv_118                 1 1 relu_110.tmp_0_splitncnn_1 relu_111.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_119                 1 1 relu_111.tmp_0 conv2d_447.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_60                   2 1 conv2d_447.tmp_0 relu_110.tmp_0_splitncnn_0 elementwise_add_46
ReLU                     Relu_112                 1 1 elementwise_add_46 relu_112.tmp_0
Split                    splitncnn_59             1 2 relu_112.tmp_0 relu_112.tmp_0_splitncnn_0 relu_112.tmp_0_splitncnn_1
Convolution              Conv_120                 1 1 relu_112.tmp_0_splitncnn_1 relu_113.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_121                 1 1 relu_113.tmp_0 conv2d_449.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_61                   2 1 conv2d_449.tmp_0 relu_112.tmp_0_splitncnn_0 elementwise_add_47
ReLU                     Relu_114                 1 1 elementwise_add_47 relu_114.tmp_0
Split                    splitncnn_60             1 3 relu_114.tmp_0 relu_114.tmp_0_splitncnn_0 relu_114.tmp_0_splitncnn_1 relu_114.tmp_0_splitncnn_2
Convolution              Conv_122                 1 1 relu_106.tmp_0_splitncnn_2 conv2d_450.tmp_0 0=18 1=1 4=-233 5=1 6=648
Interp                   Resize_7                 1 1 conv2d_450.tmp_0 bilinear_interp_v2_7.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_62                   2 1 relu_98.tmp_0_splitncnn_2 bilinear_interp_v2_7.tmp_0 tmp_14
Convolution              Conv_123                 1 1 relu_114.tmp_0_splitncnn_2 conv2d_451.tmp_0 0=18 1=1 4=-233 5=1 6=1296
Interp                   Resize_8                 1 1 conv2d_451.tmp_0 bilinear_interp_v2_8.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_63                   2 1 tmp_14 bilinear_interp_v2_8.tmp_0 tmp_15
ReLU                     Relu_115                 1 1 tmp_15 relu_115.tmp_0
Split                    splitncnn_61             1 2 relu_115.tmp_0 relu_115.tmp_0_splitncnn_0 relu_115.tmp_0_splitncnn_1
Convolution              Conv_124                 1 1 relu_98.tmp_0_splitncnn_1 conv2d_452.tmp_0 0=36 1=3 3=2 4=-233 5=1 6=5832
BinaryOp                 Add_64                   2 1 relu_106.tmp_0_splitncnn_1 conv2d_452.tmp_0 tmp_16
Convolution              Conv_125                 1 1 relu_114.tmp_0_splitncnn_1 conv2d_453.tmp_0 0=36 1=1 4=-233 5=1 6=2592
Interp                   Resize_9                 1 1 conv2d_453.tmp_0 bilinear_interp_v2_9.tmp_0 0=2 3=64 4=64
BinaryOp                 Add_65                   2 1 tmp_16 bilinear_interp_v2_9.tmp_0 tmp_17
ReLU                     Relu_116                 1 1 tmp_17 relu_116.tmp_0
Split                    splitncnn_62             1 2 relu_116.tmp_0 relu_116.tmp_0_splitncnn_0 relu_116.tmp_0_splitncnn_1
Convolution              Conv_126                 1 1 relu_98.tmp_0_splitncnn_0 relu_117.tmp_0 0=18 1=3 3=2 4=-233 5=1 6=2916 9=1
Convolution              Conv_127                 1 1 relu_117.tmp_0 conv2d_455.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=11664
BinaryOp                 Add_66                   2 1 relu_114.tmp_0_splitncnn_0 conv2d_455.tmp_0 tmp_18
Convolution              Conv_128                 1 1 relu_106.tmp_0_splitncnn_0 conv2d_456.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=23328
BinaryOp                 Add_67                   2 1 tmp_18 conv2d_456.tmp_0 tmp_19
ReLU                     Relu_118                 1 1 tmp_19 relu_118.tmp_0
Split                    splitncnn_63             1 2 relu_118.tmp_0 relu_118.tmp_0_splitncnn_0 relu_118.tmp_0_splitncnn_1
Convolution              Conv_129                 1 1 relu_115.tmp_0_splitncnn_1 relu_119.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_130                 1 1 relu_119.tmp_0 conv2d_458.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_68                   2 1 conv2d_458.tmp_0 relu_115.tmp_0_splitncnn_0 elementwise_add_48
ReLU                     Relu_120                 1 1 elementwise_add_48 relu_120.tmp_0
Split                    splitncnn_64             1 2 relu_120.tmp_0 relu_120.tmp_0_splitncnn_0 relu_120.tmp_0_splitncnn_1
Convolution              Conv_131                 1 1 relu_120.tmp_0_splitncnn_1 relu_121.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_132                 1 1 relu_121.tmp_0 conv2d_460.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_69                   2 1 conv2d_460.tmp_0 relu_120.tmp_0_splitncnn_0 elementwise_add_49
ReLU                     Relu_122                 1 1 elementwise_add_49 relu_122.tmp_0
Split                    splitncnn_65             1 2 relu_122.tmp_0 relu_122.tmp_0_splitncnn_0 relu_122.tmp_0_splitncnn_1
Convolution              Conv_133                 1 1 relu_122.tmp_0_splitncnn_1 relu_123.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_134                 1 1 relu_123.tmp_0 conv2d_462.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_70                   2 1 conv2d_462.tmp_0 relu_122.tmp_0_splitncnn_0 elementwise_add_50
ReLU                     Relu_124                 1 1 elementwise_add_50 relu_124.tmp_0
Split                    splitncnn_66             1 2 relu_124.tmp_0 relu_124.tmp_0_splitncnn_0 relu_124.tmp_0_splitncnn_1
Convolution              Conv_135                 1 1 relu_124.tmp_0_splitncnn_1 relu_125.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_136                 1 1 relu_125.tmp_0 conv2d_464.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_71                   2 1 conv2d_464.tmp_0 relu_124.tmp_0_splitncnn_0 elementwise_add_51
ReLU                     Relu_126                 1 1 elementwise_add_51 relu_126.tmp_0
Split                    splitncnn_67             1 3 relu_126.tmp_0 relu_126.tmp_0_splitncnn_0 relu_126.tmp_0_splitncnn_1 relu_126.tmp_0_splitncnn_2
Convolution              Conv_137                 1 1 relu_116.tmp_0_splitncnn_1 relu_127.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_138                 1 1 relu_127.tmp_0 conv2d_466.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_72                   2 1 conv2d_466.tmp_0 relu_116.tmp_0_splitncnn_0 elementwise_add_52
ReLU                     Relu_128                 1 1 elementwise_add_52 relu_128.tmp_0
Split                    splitncnn_68             1 2 relu_128.tmp_0 relu_128.tmp_0_splitncnn_0 relu_128.tmp_0_splitncnn_1
Convolution              Conv_139                 1 1 relu_128.tmp_0_splitncnn_1 relu_129.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_140                 1 1 relu_129.tmp_0 conv2d_468.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_73                   2 1 conv2d_468.tmp_0 relu_128.tmp_0_splitncnn_0 elementwise_add_53
ReLU                     Relu_130                 1 1 elementwise_add_53 relu_130.tmp_0
Split                    splitncnn_69             1 2 relu_130.tmp_0 relu_130.tmp_0_splitncnn_0 relu_130.tmp_0_splitncnn_1
Convolution              Conv_141                 1 1 relu_130.tmp_0_splitncnn_1 relu_131.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_142                 1 1 relu_131.tmp_0 conv2d_470.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_74                   2 1 conv2d_470.tmp_0 relu_130.tmp_0_splitncnn_0 elementwise_add_54
ReLU                     Relu_132                 1 1 elementwise_add_54 relu_132.tmp_0
Split                    splitncnn_70             1 2 relu_132.tmp_0 relu_132.tmp_0_splitncnn_0 relu_132.tmp_0_splitncnn_1
Convolution              Conv_143                 1 1 relu_132.tmp_0_splitncnn_1 relu_133.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_144                 1 1 relu_133.tmp_0 conv2d_472.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_75                   2 1 conv2d_472.tmp_0 relu_132.tmp_0_splitncnn_0 elementwise_add_55
ReLU                     Relu_134                 1 1 elementwise_add_55 relu_134.tmp_0
Split                    splitncnn_71             1 3 relu_134.tmp_0 relu_134.tmp_0_splitncnn_0 relu_134.tmp_0_splitncnn_1 relu_134.tmp_0_splitncnn_2
Convolution              Conv_145                 1 1 relu_118.tmp_0_splitncnn_1 relu_135.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_146                 1 1 relu_135.tmp_0 conv2d_474.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_76                   2 1 conv2d_474.tmp_0 relu_118.tmp_0_splitncnn_0 elementwise_add_56
ReLU                     Relu_136                 1 1 elementwise_add_56 relu_136.tmp_0
Split                    splitncnn_72             1 2 relu_136.tmp_0 relu_136.tmp_0_splitncnn_0 relu_136.tmp_0_splitncnn_1
Convolution              Conv_147                 1 1 relu_136.tmp_0_splitncnn_1 relu_137.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_148                 1 1 relu_137.tmp_0 conv2d_476.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_77                   2 1 conv2d_476.tmp_0 relu_136.tmp_0_splitncnn_0 elementwise_add_57
ReLU                     Relu_138                 1 1 elementwise_add_57 relu_138.tmp_0
Split                    splitncnn_73             1 2 relu_138.tmp_0 relu_138.tmp_0_splitncnn_0 relu_138.tmp_0_splitncnn_1
Convolution              Conv_149                 1 1 relu_138.tmp_0_splitncnn_1 relu_139.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_150                 1 1 relu_139.tmp_0 conv2d_478.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_78                   2 1 conv2d_478.tmp_0 relu_138.tmp_0_splitncnn_0 elementwise_add_58
ReLU                     Relu_140                 1 1 elementwise_add_58 relu_140.tmp_0
Split                    splitncnn_74             1 2 relu_140.tmp_0 relu_140.tmp_0_splitncnn_0 relu_140.tmp_0_splitncnn_1
Convolution              Conv_151                 1 1 relu_140.tmp_0_splitncnn_1 relu_141.tmp_0 0=72 1=3 4=-233 5=1 6=46656 9=1
Convolution              Conv_152                 1 1 relu_141.tmp_0 conv2d_480.tmp_0 0=72 1=3 4=-233 5=1 6=46656
BinaryOp                 Add_79                   2 1 conv2d_480.tmp_0 relu_140.tmp_0_splitncnn_0 elementwise_add_59
ReLU                     Relu_142                 1 1 elementwise_add_59 relu_142.tmp_0
Split                    splitncnn_75             1 3 relu_142.tmp_0 relu_142.tmp_0_splitncnn_0 relu_142.tmp_0_splitncnn_1 relu_142.tmp_0_splitncnn_2
Convolution              Conv_153                 1 1 relu_134.tmp_0_splitncnn_2 conv2d_481.tmp_0 0=18 1=1 4=-233 5=1 6=648
Interp                   Resize_10                1 1 conv2d_481.tmp_0 bilinear_interp_v2_10.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_80                   2 1 relu_126.tmp_0_splitncnn_2 bilinear_interp_v2_10.tmp_0 tmp_20
Convolution              Conv_154                 1 1 relu_142.tmp_0_splitncnn_2 conv2d_482.tmp_0 0=18 1=1 4=-233 5=1 6=1296
Interp                   Resize_11                1 1 conv2d_482.tmp_0 bilinear_interp_v2_11.tmp_0 0=2 3=128 4=128
BinaryOp                 Add_81                   2 1 tmp_20 bilinear_interp_v2_11.tmp_0 tmp_21
ReLU                     Relu_143                 1 1 tmp_21 relu_143.tmp_0
Split                    splitncnn_76             1 2 relu_143.tmp_0 relu_143.tmp_0_splitncnn_0 relu_143.tmp_0_splitncnn_1
Convolution              Conv_155                 1 1 relu_126.tmp_0_splitncnn_1 conv2d_483.tmp_0 0=36 1=3 3=2 4=-233 5=1 6=5832
BinaryOp                 Add_82                   2 1 relu_134.tmp_0_splitncnn_1 conv2d_483.tmp_0 tmp_22
Convolution              Conv_156                 1 1 relu_142.tmp_0_splitncnn_1 conv2d_484.tmp_0 0=36 1=1 4=-233 5=1 6=2592
Interp                   Resize_12                1 1 conv2d_484.tmp_0 bilinear_interp_v2_12.tmp_0 0=2 3=64 4=64
BinaryOp                 Add_83                   2 1 tmp_22 bilinear_interp_v2_12.tmp_0 tmp_23
ReLU                     Relu_144                 1 1 tmp_23 relu_144.tmp_0
Split                    splitncnn_77             1 2 relu_144.tmp_0 relu_144.tmp_0_splitncnn_0 relu_144.tmp_0_splitncnn_1
Convolution              Conv_157                 1 1 relu_126.tmp_0_splitncnn_0 relu_145.tmp_0 0=18 1=3 3=2 4=-233 5=1 6=2916 9=1
Convolution              Conv_158                 1 1 relu_145.tmp_0 conv2d_486.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=11664
BinaryOp                 Add_84                   2 1 relu_142.tmp_0_splitncnn_0 conv2d_486.tmp_0 tmp_24
Convolution              Conv_159                 1 1 relu_134.tmp_0_splitncnn_0 conv2d_487.tmp_0 0=72 1=3 3=2 4=-233 5=1 6=23328
BinaryOp                 Add_85                   2 1 tmp_24 conv2d_487.tmp_0 tmp_25
ReLU                     Relu_146                 1 1 tmp_25 relu_146.tmp_0
Split                    splitncnn_78             1 3 relu_146.tmp_0 relu_146.tmp_0_splitncnn_0 relu_146.tmp_0_splitncnn_1 relu_146.tmp_0_splitncnn_2
Convolution              Conv_160                 1 1 relu_146.tmp_0_splitncnn_2 relu_147.tmp_0 0=144 1=3 3=2 4=-233 5=1 6=93312 9=1
Split                    splitncnn_79             1 2 relu_147.tmp_0 relu_147.tmp_0_splitncnn_0 relu_147.tmp_0_splitncnn_1
Convolution              Conv_161                 1 1 relu_143.tmp_0_splitncnn_1 relu_148.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_162                 1 1 relu_148.tmp_0 conv2d_490.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_86                   2 1 conv2d_490.tmp_0 relu_143.tmp_0_splitncnn_0 elementwise_add_60
ReLU                     Relu_149                 1 1 elementwise_add_60 relu_149.tmp_0
Split                    splitncnn_80             1 2 relu_149.tmp_0 relu_149.tmp_0_splitncnn_0 relu_149.tmp_0_splitncnn_1
Convolution              Conv_163                 1 1 relu_149.tmp_0_splitncnn_1 relu_150.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_164                 1 1 relu_150.tmp_0 conv2d_492.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_87                   2 1 conv2d_492.tmp_0 relu_149.tmp_0_splitncnn_0 elementwise_add_61
ReLU                     Relu_151                 1 1 elementwise_add_61 relu_151.tmp_0
Split                    splitncnn_81             1 2 relu_151.tmp_0 relu_151.tmp_0_splitncnn_0 relu_151.tmp_0_splitncnn_1
Convolution              Conv_165                 1 1 relu_151.tmp_0_splitncnn_1 relu_152.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_166                 1 1 relu_152.tmp_0 conv2d_494.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_88                   2 1 conv2d_494.tmp_0 relu_151.tmp_0_splitncnn_0 elementwise_add_62
ReLU                     Relu_153                 1 1 elementwise_add_62 relu_153.tmp_0
Split                    splitncnn_82             1 2 relu_153.tmp_0 relu_153.tmp_0_splitncnn_0 relu_153.tmp_0_splitncnn_1
Convolution              Conv_167                 1 1 relu_153.tmp_0_splitncnn_1 relu_154.tmp_0 0=18 1=3 4=-233 5=1 6=2916 9=1
Convolution              Conv_168                 1 1 relu_154.tmp_0 conv2d_496.tmp_0 0=18 1=3 4=-233 5=1 6=2916
BinaryOp                 Add_89                   2 1 conv2d_496.tmp_0 relu_153.tmp_0_splitncnn_0 elementwise_add_63
ReLU                     Relu_155                 1 1 elementwise_add_63 relu_155.tmp_0
Split                    splitncnn_83             1 4 relu_155.tmp_0 relu_155.tmp_0_splitncnn_0 relu_155.tmp_0_splitncnn_1 relu_155.tmp_0_splitncnn_2 relu_155.tmp_0_splitncnn_3
Convolution              Conv_169                 1 1 relu_144.tmp_0_splitncnn_1 relu_156.tmp_0 0=36 1=3 4=-233 5=1 6=11664 9=1
Convolution              Conv_170                 1 1 relu_156.tmp_0 conv2d_498.tmp_0 0=36 1=3 4=-233 5=1 6=11664
BinaryOp                 Add_90                   2 1 conv2d_498.tmp_0 relu_144.tmp_0_splitncnn_0 elementwise_add_64
ReLU                     Relu_157                 1 1 elementwise_add_64 relu_157.tmp_0
Split                    splitncnn_84             1 2 relu_157.tmp_0 relu_157.tmp_0_splitncnn_0 relu_157.tmp_0_splitncnn_1
